lamilami/stm32-base-chibios-3/doc/CubeMX/STM32F050F.ioc
#MicroXplorer Configuration settings - do not modify
#Fri Jun 06 16:57:45 MSK 2014
File.Version=1
KeepUserPlacement=true
Mcu.Family=STM32F0
Mcu.IP0=SPI1
Mcu.IP1=SYS
Mcu.IP2=TIM2
Mcu.IPNb=3
Mcu.Name=STM32F050F(4-6)Px
Mcu.Package=TSSOP20
Mcu.Pin0=PF0-OSC_IN
Mcu.Pin1=PF1-OSC_OUT
Mcu.Pin10=PA13
Mcu.Pin11=PA14
Mcu.Pin2=PA0
Mcu.Pin3=PA1
Mcu.Pin4=PA2
Mcu.Pin5=PA3
Mcu.Pin6=PA4
Mcu.Pin7=PA5
Mcu.Pin8=PA6
Mcu.Pin9=PA7
Mcu.PinsNb=12
PA0.Mode=PWM-Generation
PA0.Signal=TIM2_CH1_ETR
PA1.Mode=PWM-Generation
PA1.Signal=TIM2_CH2
PA13.Mode=Serial-WireDebug
PA13.Signal=SYS_SWDAT
PA14.Mode=Serial-WireDebug
PA14.Signal=SYS_SWCLK
PA2.Mode=PWM-Generation
PA2.Signal=TIM2_CH3
PA3.Mode=PWM-Generation
PA3.Signal=TIM2_CH4
PA4.Mode=Full-Duplex-Master_With-NSS
PA4.Signal=SPI1_NSS
PA5.Mode=Full-Duplex-Master_With-NSS
PA5.Signal=SPI1_SCK
PA6.Mode=Full-Duplex-Master_With-NSS
PA6.Signal=SPI1_MISO
PA7.Mode=Full-Duplex-Master_With-NSS
PA7.Signal=SPI1_MOSI
PF0-OSC_IN.Signal=GPIO_Output
PF1-OSC_OUT.Signal=GPIO_Output
